openfoam_case_tc2/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 10.0 0);

boundaryField
{
    inlet   { type fixedValue;    value uniform (0 10.0 0); }
    outlet  { type zeroGradient; }
    ground  { type noSlip; }
    top     { type slip; }
    sides   { type slip; }
    buildings { type noSlip; }
}
