openfoam_case_tc2/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.375;

boundaryField
{
    inlet       { type fixedValue; value uniform 0.375; }
    outlet      { type zeroGradient; }
    ground      { type kqRWallFunction; value uniform 0.375; }
    top         { type zeroGradient; }
    sides       { type zeroGradient; }
    buildings   { type kqRWallFunction; value uniform 0.375; }
}
