openfoam_case_tc2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          5000;
        startFace       2751136;
    }
    outlet
    {
        type            patch;
        nFaces          5000;
        startFace       2756136;
    }
    ground
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          13386;
        startFace       2761136;
    }
    top
    {
        type            patch;
        nFaces          7500;
        startFace       2774522;
    }
    sides
    {
        type            patch;
        nFaces          7500;
        startFace       2782022;
    }
    buildings
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          239208;
        startFace       2789522;
    }
)

// ************************************************************************* //
