openfoam_case_tc2/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         500;
deltaT          1;
writeControl    timeStep;
writeInterval   100;
purgeWrite      2;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    sample_z1p5
    {
        type                surfaces;
        libs                (sampling);
        enabled             yes;
        writeControl        timeStep;
        writeInterval       500;
        surfaceFormat       raw;
        interpolationScheme cellPoint;
        fields              ( U );
        surfaces
        {
            zPed
            {
                type        cuttingPlane;
                planeType   pointAndNormal;
                pointAndNormalDict
                {
                    point  (0 0 1.5);
                    normal (0 0 1);
                }
                interpolate true;
            }
        }
    }
}
